package com.example.mind_maker.apter;

public class MonkText {
    String textList[]=new String[15];
    public MonkText()       //模拟文字
    {
        init();
    }
    public void init()
    {
        textList[0]="我们党历来高度重视青年人才工作，在革命、建设、改革各个历史时期制定和实施了一系列重大方针政策和措施,使大批青年人才不断涌现、建功立业。进入新时代，青年人才为经济社会发展作出了重要贡献，在服务创新驱动发展、推动区域协调发展、决战脱贫攻坚、决胜全面小康、抗击新冠肺炎疫情等国家重大战略和重大工作中发挥了重要作用，在经济建设主战场、文化发展大舞台、社会建设新领域、科技创新最前沿、重点项目第一线、基层实践大熔炉中贡献聪明才智，书写青春篇章。";
        textList[1]="在浙江余姚，志愿者通过课堂讲解、长卷绘画等形式，引导孩子们树立绿色低碳理念；在广东深圳宝安区，生态游学、“邮包伴侣”等活动精彩纷呈，营造节能降碳浓厚氛围……不久前的全国节能宣传周期间，各地开展丰富多彩的活动，为全社会共同参与实现“双碳”目标注入强大正能量。";
        textList[2]="实现“双碳”目标是一场广泛而深刻的变革，不是轻轻松松就能实现的，必须付出更大努力。面向未来，持续向社会公众普及气候变化知识，积极在国民教育体系中突出包括气候变化和绿色发展在内的生态文明教育，激发节能降碳的内生动力，我们就一定能让绿色低碳节俭之风吹进千家万户，为实现“双碳”目标作出更大贡献。";

        textList[3]="贾湖村曾因贾湖遗址的考古发掘受到关注，贾湖骨笛的发现填补了中国早期新石器文化的重要缺项，成为中国音乐文化九千年文明史的有力佐证。然而，考古发现并未给该村的发展带来助益。直到最近几年，伴随着乡村振兴的号角，当地开始把九千年的古老文明与乡村发展结合起来，从古文明中寻找致富密码。贾湖村不仅在村容村貌上焕然一新，还根据历史遗存，传承传统酿造技术，研发生产贾湖酒等，使之成为乡村发展的文化力量。";
        textList[4]="近几年，随着高校的扩招，高校学生人数逐年增强，加上面对疫情防控的严峻形势，造成部分企业经营遇到困难，新增岗位逐步减少，全国经济形势和就业形势不容乐观，特别是近几年新增的大学生就业群体，急需就业吸收，保持社会稳定。当前，处于高校毕业生就业的关键阶段，政府机构和社会各界应多措并举、做实做细就业服务工作，促进高校毕业生能就业，就好业，处理好学校、企业和政府多方资源，形成合力，为“最难就业年”保驾护航。";
//        textList[5]="当前正是高校毕业生就业的关键阶段，要进一步挖掘岗位资源，做实做细就业指导服务，学校、企业和有关部门要抓好学生就业签约落实工作，尤其要把脱贫家庭、低保家庭、零就业家庭以及有残疾的、较长时间未就业的高校毕业生作为重点帮扶对象”。习近平总书记的重要讲话精神为当前促进高校毕业生就业提供了重要遵循。各方要各司其职，各尽其责，形成促进高校毕业生就业的强大合力";
        textList[5]="“毕业出路”成为大学生活的“指挥棒”，人们无法也不能对这样的结果给予非黑即白式的评价。对不同的学校、不同的专业、不同的生活环境下的大学生而言，是否需要从大一就开始考虑毕业出路，是没法给出定式答案的。只不过，将这一问题放置于社会发展视角下看，仍然得说大学生活不应该唯“毕业出路”论。而更需要指出的是，令人焦虑的“毕业出路”，其核心不是担忧找不到工作，而是希望找到一份社会认知意义上的好的工作——进大厂亦或考公。从高校连年扩招能够看出，高等教育已经完全具备成为一项普惠性质的知识服务的条件。这意味着高等教育不再是一种精英化教育。";

        textList[6]="要在深刻理解协同学理论内涵基础上，精准把握“减污”同“降碳”两个子系统之间相互合作、相互影响、相互制约的关系，以实现两个子系统的目标协同、区域协同、路径协同以及政策协同";
        textList[7]="在社会生产中，资本同土地、劳动力、技术、数据等一样，都是一种生产要素，可以说，只要还存在社会生产，资本就一直伴随着而存在。资本还是一种重要的生产要素，发挥着带动各类生产要素集聚配置的重要纽带作用。在社会主义市场经济下，市场在资源配置中起决定性作用，依靠资本的带动，各类生产要素可以快速集聚、优化配置，进而实现社会生产的目的。";
        textList[8]="其次，对重点群体重点关注，防止出现群体性失业。精准施策抓好高校毕业生、新生代农民工、技工院校毕业生等重点群体就业帮扶。全力做好高校毕业生就业工作，引导他们树立正确的就业观，脚踏实地从基层做起，为年轻大学生创设适宜的发展通道，引导支持高校毕业生到城乡社区就业，到广阔的基层平台施展才华。建立跨省劳动力就业信息和就业数据共享国家级公益平台。针对今年的高校毕业生，适当实行弹性学制，适当延缓毕业生就业时间。对于毕业暂未就业的学生，可提供校园住宿、生活补贴等支持。";

        textList[9]="中华优秀传统文化积淀着中华民族最深沉的精神追求，代表着中华民族独特的精神标识，是中华民族生生不息、发展壮大的丰厚滋养，是中国特色社会主义植根的文化沃土，是我们在世界文化激荡中站稳脚跟的根基。";
        textList[10]="纵观人类发展历史，“开放带来进步，封闭导致落后”。在中华民族五千年的发展史中，开放的时代，是繁盛的时代、快速发展的时代；封闭的时期，则是落后的时期、发展迟缓的时期。汉唐盛世，因开放而更加繁荣。";
        textList[11]="开放是实现国家繁荣富强的根本出路。改革开放以来，中国深度融入国际分工体系，以开放促改革、促发展，迅速成长为世界第二大经济体、第一大贸易国，引进外资和对外投资也名列前茅，取得了经济发展的巨大成就。中国是经济全球化的积极参与者和坚定支持者，也是重要建设者和主要受益者。";

        textList[12]="习近平总书记在庆祝中国共产党成立100周年大会上指出，我们坚持和发展中国特色社会主义，推动物质文明、政治文明、精神文明、社会文明、生态文明协调发展，创造了中国式现代化新道路，创造了人类文明新形态。之后，在中国共产党与世界政党领导人峰会上，习近平以中共中央总书记、中华人民共和国主席的身份发表主旨演讲，再次谈到了中国式现代化：“中国共产党将团结带领中国人民深入推进中国式现代化，为人类对现代化道路的探索作出新贡献。”";
        textList[13]="中国共产党的领导是历史的选择、是人民的选择。在中国共产党诞生之前、诞生之后，中国涌现了无数政党，都为救国救民提出了不同方案。事实证明，惟有中国共产党的正确领导，才让多灾多难的中国人民真正看到希望。没有中国共产党的正确领导，是不可能打败日本帝国主义的，也是不可能推翻国民党反动统治的，更不可能完成新民主主义革命，建立中华人民共和国。今天，中华民族迎来了从站起来、富起来到强起来的伟大飞跃，也是因为有了中国共产党的正确领导";
        textList[14]="走中国式现代化新道路，必须坚持中国共产党的领导。因为有了中国共产党的正确领导，党的事业才不会迷失，我们走现代化之路才不会出现方向性错误。自成立之日起，中国共产党就把为中国人民谋幸福、为中华民族谋复兴确立为自己的初心使命，就把为共产主义、社会主义而奋斗确定为自己的纲领。百年以来，这个初心使命从未改变，为共产主义、社会主义而奋斗的纲领也始终未变。";
    }
}
